test/tryWithRe100/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       537982;
    }
    shape
    {
        type            wall;
        inGroups        1(wall);
        nFaces          673;
        startFace       538032;
    }
    outlet
    {
        type            patch;
        nFaces          317;
        startFace       538705;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          62;
        startFace       539022;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          62;
        startFace       539084;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          714496;
        startFace       539146;
    }
)

// ************************************************************************* //
